#+title: ECSQL
#+author: Aidan Hall
#+todo: TODO DOING(!) | DONE(@) CANCELLED(@)
*** TODO Asynchronous REPL
:LOGBOOK:
CLOCK: [2024-02-20 Tue 11:28]--[2024-02-20 Tue 11:53] =>  0:25
CLOCK: [2024-02-20 Tue 10:57]--[2024-02-20 Tue 11:22] =>  0:25
:END:
We want the game to progress and have the REPL available
simultaneously, without blocking either.

Problems:
- Lexer uses a global, static buffer for reading in lexemes, which is
  not thread-safe (easy).
- Lisp memory allocation (medium).
- Namespace/environment access etc (hard-ish: what is "etc"?).
- ECS, in general, is not thread-safe.

Goal:
- Main game loop is mostly normal, running a set of Systems and
  refreshing the screen each frame.
  - Can call into Lisp(?), perhaps only via a special Lisp callback
    System.
- REPL available simultaneously. Once a complete sexp is read, the
  input Lisp form is evaluated, perhaps on the next frame, and
  the result is printed out.

Options:
- [ ] Single threaded with non-blocking I/O.
  - Use non-blocking stdio for the reader (unlocked_stdio(3)), and
    dispatch to Lisp as soon as a complete sexp is read.
  - Relies on non-standard (POSIX) functions
  - Potentially unpredictable
  - Complex to structure(?) since we need to repeatedly call the
    reader polling function.
- [ ] Basic locking: Allow simultaneous threads, but acquire a
  lock to allocate memory, add to a namespace etc.
  - Extreme false dependencies and high contention, since current Lisp
    implementation conses continously to evaluate code, leading to
    slower, serial execution regardless.
  - Hard to be sure all thread-unsafe operations are locked properly.
  - Could be viable if we replace the evaluator with a bytecode VM
    that conses less during execution, but we don't have time for that
    now (<2024-02-20 Tue>).
- [ ] Lisp command event queue (cite:
  http://gameprogrammingpatterns.com/event-queue.html)
  - Game code and REPL send Lisp expressions to the event queue to
    evaluate, with a single thread receiving events and executing
    them.
  - Problematic since generating expressions (e.g. while parsing)
    requires consing, so we may need locked cons.
  - Callers often want the result of the expression, so they would
    need to block until their expression was evaluated.
- [X] Global Lisp lock: Public expression evaluation API acquires a
  lock stored in the LispEnv for the duration of evaluation, then
  releases it.
  - Could greatly increase complexity of existing code if all public
    APIs must include locking.
  - A fixed, finite number of places where locking happens (Lisp System
    wrapper System, REPL) makes this feasible.
  - REPL must be written in C.
- [ ] Pause the game to run the REPL, or any Lisp code (giving up):
  - Possibly suitable if I spin it right.
  - Main viable option for evaluation day (<2024-02-21 Wed>).
**** DONE Lexer
:LOGBOOK:
- State "DONE"       from "DOING"      [2024-01-11 Thu 18:11] \\
  - Decided against active UTF-8 support, but it would probably work.
  - Treat ~@~ as a stand-alone Token. The parser can easily "look ahead"
    when it gets a ~,~ to see if it should be a normal or splicing
    unquote.
CLOCK: [2024-01-11 Thu 18:04]--[2024-01-11 Thu 18:11] =>  0:07
CLOCK: [2024-01-11 Thu 14:50]--[2024-01-11 Thu 18:04] =>  3:14
- State "DOING"      from "TODO"       [2024-01-11 Thu 14:49]
:END:
- [X] Token type
- [ ] +UTF-8+
This either needs to operate on a string buffer in memory, or a
~FILE*~.  There are platform-dependent ways to access a string buffer
as a ~FILE*~, and many platform-independent operators for ~FILE*~'s,
so we will use ~FILE*~.
**** DONE Lisp Object Physical Representation
:LOGBOOK:
- State "DONE"       from "DOING"      [2024-01-15 Mon 10:26] \\
  We found a reasonable compromise representation.
CLOCK: [2024-01-12 Fri 15:11]--[2024-01-12 Fri 19:26] =>  4:15
CLOCK: [2024-01-11 Thu 18:19]--[2024-01-11 Thu 18:22] =>  0:03
- State "DOING"      from "TODO"       [2024-01-11 Thu 18:18]
:END:
- For this, consider 64-bit integer boxing.
- Notable: There are 12 unused bits in Mertens's Entity
  representation, and we can probably shave off a few bits from the
  generation and Entity, so this could fit inside a NaN box!
- Queinnec: p. 391, tinylisp: p. 7-9

I need a representation for Lisp objects that is simple enough to
manipulate inline with generated LLIR, and reasonably efficient.

**** DOING Queries
:LOGBOOK:
CLOCK: [2024-02-20 Tue 12:09]--[2024-02-20 Tue 12:34] =>  0:25
- State "DOING"      from "TODO"       [2024-02-15 Thu 10:42]
:END:
The general API needs to be something like: ~Predicate → Archetype[]~
***** DONE Query Result Representation
:LOGBOOK:
- State "DONE"       from "DOING"      [2024-02-20 Tue 22:42] \\
  Straightforwardish, kept abstract to make future changes easy.
CLOCK: [2024-02-16 Fri 15:57]--[2024-02-16 Fri 16:57] =>  1:00
- State "DOING"      from "TODO"       [2024-02-16 Fri 15:57]
:END:
- This informs the capabilities of the query system.
- Generality vs Efficiency?
- How do results and generated Lisp code (with bindings) match up?
Single-archetype queries:
#+begin_src c
struct QueryEntry {
  ArchetypeID archetype;
  /* What column each matched Component with storage is in.
   ,* The alternative is doing a lookup per Component per Archetype,
   ,* which could be alright if fragmentation is low. */
  size columns[];
};
#+end_src
Multiple-archetype Queries:
#+begin_src c
struct QueryEntry {
  ArchetypeID archetypes[];
  /* The Lisp macro or C system author should statically know what archetype to
   * use for each column index lookup. */
  size columns[];
};
#+end_src
